Перем юТест;

////////////////////////////////////////////////////////////////////
// Программный интерфейс

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
	
	юТест = ЮнитТестирование;
	
	ВсеТесты = Новый Массив;

	ВсеТесты.Добавить("ТестДолжен_СоздатьОбъект");
	ВсеТесты.Добавить("ТестДолжен_СоздатьПрозвонитьЛокальныйУзел");
	ВсеТесты.Добавить("ТестДолжен_СоздатьПрозвонитьНесуществующийУзел");

	Возврат ВсеТесты;
	
КонецФункции

Процедура ТестДолжен_СоздатьОбъект() Экспорт

	Звень = Новый Звень;

КонецПроцедуры


Процедура ТестДолжен_СоздатьПрозвонитьЛокальныйУзел() Экспорт

	Звень = Новый Звень;
	Озвень = Звень.Послать("localhost", 5);

	юТест.ПроверитьРавенство(Озвень.Состояние, СостояниеПрозвона.Успешно);

КонецПроцедуры

Процедура ТестДолжен_СоздатьПрозвонитьНесуществующийУзел() Экспорт

	Звень = Новый Звень;
	Озвень = Звень.Послать("12.13.15.16", 5);

	юТест.ПроверитьНеРавенство(Озвень.Состояние, СостояниеПрозвона.Успешно);

КонецПроцедуры
